#define _CRT_SECURE_NO_WARNINGS 1 
#include <stdio.h>
#include <string.h>

//int main()
//{
//	//整数除法
//	int a = 3 / 5;// 0; 只有一边有小数，才能进行小数运算
//	int b = 6 / 5;// 1;
//	float c = 6 / 5;
//
//	//float d = 6.0 / 5;
//	float d = 6.0f / 5.0f;
//
//	printf("%d\n", a);
//	printf("%d\n", b);
//	printf("%f\n", c);
//	printf("%f\n", d);
//
//	return 0;
//}

//int main()
//{
//	int a = 7 % 3.0;// 1
//	printf("%d\n", a);
//
//	return 0;
//}



//int main()
//{
//	int a = 2;
//	//把a的二进制位向左移动一位
//	int b = a << 1;
//	printf("%d\n", b);
//
//	return 0;
//}

//int main()
//{
//	int a = 10;
//	//把a的二进制位向右移动一位
//	int b = a >> 1;
//	printf("%d\n", b);
//	printf("%d\n", a);
//
//	return 0;
//}

//int main()
//{
//	int a = -1;
//	int b = a >> 1;
//	//当前的右移操作符采用的是算术右移
//	printf("%d\n", b);
//	return 0;
//}
//

//int main()
//{
//	int a = 10;
//	int b = a << -5;//a>>5;移动负数位永远不要写，编译器都看不懂
//
//
//	return 0;
//}

//int main()
//{
//	int a = 3;
//	int b = 5;
//
//	// ^ 按位异或（按二进制） （对应的二进制位进行异或，相同为0，相异为1）
//	int c = a ^ b;
//	//00000000000000000000000000000011  :3
//	//00000000000000000000000000000101  :5
//	//00000000000000000000000000000110  :6
//	printf("%d\n", c);
//
//	// 
//	// | 按位或（按二进制）（对应的二进制位只要有1，就是1，两个都是0，才为0）
//	//int c = a | b;
//	//printf("%d\n", c);
//
//	//00000000000000000000000000000011  :3
//	//00000000000000000000000000000101  :5
//	//00000000000000000000000000000111  :7
//
//	
//	// 
//	// & 按位与（按二进制）（对应的二进制位只有有0，按位与就是0，两个都是1，才为1）
//	//int c = a & b;
//	//
//	////00000000000000000000000000000011  :3
//	////00000000000000000000000000000101  :5
//	////00000000000000000000000000000001  :c  1
//
//	//printf("%d\n", c);
//
//	return 0;
//}

//int main()
//{
//	int a = 3;
//	int b = 5;
//	//不引入第三个变量用来交换
//	//1.有缺陷，因为a，b数值太大会导致溢出（只针对部分数据，小数据）
//	/*printf("a = %d, b = %d\n", a, b);
//	a = a + b;
//	b = a - b;
//	a = a - b;
//	printf("a = %d, b = %d\n", a, b);*/
//
//	//2. 
//	//00000000000000000000000000000011  :3
//	//00000000000000000000000000000101  :5
//	printf("a = %d, b = %d\n", a, b);
//	a = a ^ b;
//	b = a ^ b;
//	a = a ^ b;
//	printf("a = %d, b = %d\n", a, b);
//
//
//	//引入第三个变量来交换
//	//printf("a = %d, b = %d\n", a, b);
//	//int c = a;
//	//a = b;
//	//b = c;
//	//printf("a = %d, b = %d\n", a, b);
//
//	return 0;
//}

//int main()
//{
//	int a = 3;
//	//a ^ a = 0;
//	//0 ^ a = a;
//	//000
//	//011
//	//011
//
//	//011
//	//011
//	//000
//
//	return 0;
//}

//编写代码实现：求一个整数存储在内存中的二进制中1的个数
//这里运用了一个思想，就是按位与 |和右移操作符，按位与是什么呢
//按位与就是相同为1，不同为0，那就拿1的二进制来计算

//int main()
//{
//	int a = 13;
//	//000000000000000000000000000001101
//	//000000000000000000000000000000001
//	// 
//	//000000000000000000000000000000001
//	return 0;
//}

//int main()
//{
//	int a = 0;
//	scanf("%d", &a);
//	int count = 0;
//	int i = 0;
//	for (i = 0; i < 32; i++)
//	{
//		if (a & 1)
//		{
//			count++;
//		}
//		a = a >> 1;
//	}
//	printf("%d\n", count);
//
//	return 0;
//}

//int main()
//{
//	int a = 3;
//	int b = 5;
//
//	printf("刚开始：a = %d, b = %d\n", a, b);
//	a = a ^ b;
//	b = a ^ b;
//	a = a ^ b;
//	printf("转换后：a = %d, b = %d\n", a, b);
//}


//int main()
//{
//	int a = 13;
//	//把a的二进制中的第5位置成1
//	a = a | (1 << 4);
//	printf("a = %d\n", a);
//	//把a的二进制中的第5位置成0
//	a = a & ~(1 << 4);
//	printf("a = %d\n", a);
//
//
//	//0000000000000000000000000001101
//	//0000000000000000000000000010000
//	//0000000000000000000000000011101
//	//1<<4
//
//	//0000000000000000000000000011101s
//	//1111111111111111111111111101111
//	//0000000000000000000000000010000
//	//1<<4
//
//	return 0;
//}

//int main()
//{
//	int a = 10;
//	a = 100;
//	a = a + 100;
//	a += 100;
//	a = a >> 3;
//	a >>= 3;
//
//
//	return 0;
//}

//一个等号是赋值，两个等号是判断


//int main()
//{
//	int flag = 0;
//	printf("%d\n", !flag);
//	//flag为真打印hehe
//	//if (flag)
//	//{
//	//	printf("hehe\n");
//	//}
//	////flag为假打印haha
//	//if (!flag)
//	//{
//	//	printf("haha\n");
//	//}
//	//return 0;
//}

//单目操作符 - 只有一个操作数

//int main()
//{
//	int a = 10;
//	a = -a;
//	a = +a;
//	printf("%d\n", a);
//
//
//	return 0;
//}

//int main()
//{
//	short s = 5;
//	int a = 10;
//	printf("%d\n", sizeof(s = a + 2));
//	printf("%d\n", s);
//	
//
//
//
//	//int a = 10;
//	//int arr[10] = { 0 };
//	//printf("%d\n", sizeof(arr));//单位是字节
//	//printf("%d\n", sizeof(int [10]));//单位是字节//40 - int [10]是arr数组的类型
//
//
//	//printf("%d\n", sizeof(a));//计算a所占空间的大小，单位为字节。
//	//printf("%d\n", sizeof(int));
//	//printf("%d\n", sizeof a);
//	////证明sizeof是操作符，不是函数，函数后面的()不能省略
//
//	return 0;
//}

//
//int main()
//{
//	int a = -1;
//	//10000000000000000000000000000001 - 原码
//	//11111111111111111111111111111110 - 反码
//	//11111111111111111111111111111111 - 补码
//	//-1的补码就是全1
//	// ~按位取反（所有位子包括符号位）
//	int b = ~a;
//	//00000000000000000000000000000000
//	printf("%d\n", b);
//	printf("%d\n", a);
//
//
//	return 0;
//}


//int main()
//{
//	int a = 1;
//	int b = (++a) + (++a) + (++a);
//	printf("%d\n", b);
//
//	return 0;
//}

